{
  "basics": {
    "name": "Travis Meyer",
    "label": "Senior Data Scientist | Neuroscientist | AI/ML",
    "image": "",
    "email": "travismeyerphd@gmail.com",
    "phone": "",
    "url": "www.travismeyer.com",
    "summary": "An American brain-inspired data scientist, developing AI algorithms from primate visual circuitry.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Philadelphia",
      "countryCode": "US",
      "region": "Pennsylvania"
    },
    "profiles": [
      {
        "network": "LinkedIn  ",
        "username": "",
        "url": "www.linkedin.com/in/travis-meyer-4b3b2315"
      }
    ]
  },
  "work": [
    {
      "name": "Vanguard",
      "position": "Senior Data Scientist",
      "url": "https://travismeyer.com",
      "startDate": "2024-09-01",
      "endDate": "",
      "summary": "Developing AI algorithms to improve customer experience and reduce costs.",
      "highlights": ["NLP, ML, AI, AWS, Python, SQL"]
    },
    {
      "name": "University of Pennsylvania",
      "position": "Director, Senior Research Scientist",
      "url": "https://psychology.sas.upenn.edu/people/travis-meyer-0",
      "startDate": "2015-01-01",
      "endDate": "2024-08-31",
      "summary": "Directed Neuroscience Laboratories, developing AI algorithms from primate visual circuitry.",
      "highlights": ["Primate Vision, Experimentation, AI, ML, Python, Matlab"]
    },
    {
      "name": "Carnegie Mellon University",
      "position": "Senior Research Scientist",
      "url": "https://cmu.edu",
      "startDate": "2008-09-01",
      "endDate": "2014-12-31",
      "summary": "Developing AI algorithms from primate visual circuitry.",
      "highlights": ["Primate Vision, Experimentation, AI, ML, Python, Matlab"]
    }
  ],  
  "education": [
    {
      "institution": "Wake Forest University",
      "location": "Winston Salem, NC",
      "url": "https://www.wfu.edu",
      "area": "Neuroscience",
      "studyType": "PhD",
      "startDate": "2002",
      "endDate": "2008"      
    }
  ],  
  "projects": [
    {
      "name": "TravNet",
      "summary": "A computer vision project to automate sorting of neuron clusters - saving ~2 hours per day.",
      "highlights": ["CNNs", "DataWrangling"],
      "startDate": "2022",
      "endDate": "2024",
      "url": "https://github.com/meyert11/travnet"
    },
    {
      "name": "Document Scanner",
      "summary": "A computer vision project to automate the identification of sensative financial documents.",
      "highlights": ["Multimodal Transformers", "AWS prod development"],
      "startDate": "2024",
      "endDate": "present",
      "url": ""
    },
    {
      "name": "CSAT scanner",
      "summary": "An NLP model using BeRT to cluster and estimate customer senitment using customer survey data",
      "highlights": ["BeRT Models", "NLP, Clustering"],
      "startDate": "2024",
      "endDate": "2025",
      "url": ""
    }
  ],  
  "certificates": [
    {
      "name": "AWS Machine Learning Specialist",
      "date": "2025",
      "issuer": "AWS",
      "url": "",
      "icon": "fa-solid fa-location-dot"
    },
    {
      "name": "Applied Machine Learning: Ensemble Learning",
      "date": "2024",
      "issuer": "LinkedIn",
      "url": "https://www.linkedin.com/learning/certificates/289bb9a4607b7a4eb23c8e43214453b01e289cd5e30c53f9724a79e579b7fd79?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_certifications_details%3BrzHG%2BFTXQ8y2XRvxvCXBZQ%3D%3D",
      "icon": "fa-solid fa-tag"
    },
    {
      "name": "Computer Vision for Data Scientists",
      "date": "2024",
      "issuer": "LinkedIn",
      "url": "https://www.linkedin.com/learning/certificates/f14495325e26e66d1ec38ccf681713dedda23a284a84054c8ff2f1b13831767c?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_certifications_details%3BrzHG%2BFTXQ8y2XRvxvCXBZQ%3D%3D",
      "icon": "fa-solid fa-envelope"
    },
    {
      "name": "NLP with Python for Machine Larning",
      "date": "2024",
      "issuer": "LinkedIn",
      "url": "https://www.linkedin.com/learning/certificates/8863d586068280bef1d84b4ff41ef19230b582abfce3e3cbe991a9913d18cca1?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_certifications_details%3BrzHG%2BFTXQ8y2XRvxvCXBZQ%3D%3D",
      "icon": "fa-solid fa-hashtag"
    }
  ],
  "skills": [
    {
      "name": "Artifical Intelligence",
      "level": "Expert",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Computer Vision",
        "Neural Networks",
        "Big Data Infrastructure",
        "AWS Sagemaker",
        "API Development",
        "NLP"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "German",
      "fluency": "Good",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "Neural Networks",
      "icon": "fa-solid fa-tag",
      "keywords": [
        "Building home labs",
        "Trying out new models",
        "Reading papers"     
      ]
    },
    {
      "name": "Flying",
      "icon": "fa-solid fa-tag",
      "keywords": [
        "Flight simulators are my jam",
        "Sea planes - Icon A5 <3",
        "Can't wait for electric VTOLs"
      ]
    }
  ],
  "publications": [
    {
      "name": "Pinpointing the neural signatures of single-exposure visual recognition memory",
      "publisher": "Proceedings of the National Academy of Sciences",
      "releaseDate": "Apr 2021",
      "url": "https://meyerbox.travismeyer.us/url/tfqxx3nvnwkzpf2y",
      "summary": "Memories of the images that we have seen are thought to bereflected in the reduction of neural responses in high-level visualareas such as inferotemporal (IT) cortex, a phenomenon known asrepetition suppression (RS)"
    },
    {
      "name": "Population response magnitude variation in inferotemporal cortex predicts image memorability",
      "publisher": "eLife",
      "releaseDate": "Aug 2019",
      "url": "https://meyerbox.travismeyer.us/url/mdhe25fcubbidxbx",
      "summary": "Most accounts of image and object encoding in inferotemporal cortex (IT) focus on thedistinct patterns of spikes that different images evoke across the IT population. By analyzing datacollected from IT as monkeys performed a visual memory task, we demonstrate that variation in acomplementary coding scheme, the magnitude of the population response, can largely account forhow well images will be remembered."
    },
    {
      "name": "Single-exposure visual memory judgments are reflected in inferotemporal cortex",
      "publisher": "eLife",
      "releaseDate": "Mar 2018",
      "url": "https://meyerbox.travismeyer.us/url/hahixi5qiccuiwyq",
      "summary": "Our visual memory percepts of whether we have encountered specific objects orscenes before are hypothesized to manifest as decrements in neural responses in inferotemporalcortex (IT) with stimulus repetition. To evaluate this proposal, we recorded IT neural responses astwo monkeys performed a single-exposure visual memory task designed to measure the rates offorgetting with time."
    },
    {
      "name": "Prediction suppression and surprise enhancement in monkey inferotemporal cortex",
      "publisher": "Journal of Neurophysiology",
      "releaseDate": "Jul 2017",
      "url": "https://meyerbox.travismeyer.us/url/yadqnw6ehgujadtp",
      "summary": "Exposing monkeys, over the course of daysand weeks, to pairs of images presented in fixed sequence, so that eachleading image becomes a predictor for the corresponding trailingimage, affects neuronal visual responsiveness in area TE. At the endof the training period, neurons respond relatively weakly to a trailingimage when it appears in a trained sequence and, thus, confirmsprediction, whereas they respond relatively strongly to the same imagewhen it appears in an untrained sequence and, thus, violates predic-tion."
    },
    {
      "name": "Prediction suppression in monkey inferotemporal cortex depends on the conditional probability between images",
      "publisher": "Journal of Neurophysiology",
      "releaseDate": "Jan 2016",
      "url": "https://meyerbox.travismeyer.us/url/yxpe2pyw2gxvmmkq",
      "summary": "When monkeysview two images in fixed sequence repeatedly over days and weeks,neurons in area TE of the inferotemporal cortex come to exhibitprediction suppression. The trailing image elicits only a weak re-sponse when presented following the leading image that preceded itduring training."
    },
    {
      "name": "Image familiarization sharpens response dynamics of neurons in inferotemporal cortex",
      "publisher": "Nature Neuroscience",
      "releaseDate": "Aug 2014",
      "url": "https://meyerbox.travismeyer.us/url/tjx3jsptehan2dyf",
      "summary": "Repeated viewing of an image over days and weeks induces a marked reduction in the strength with which neurons in monkey inferotemporal cortex respond to it. The processing advantage that attaches to this reduction is unknown."
    },
    {
      "name": "Differences in Intrinsic Functional Organization Between Dorsolateral Prefrontal and Posterior Parietal Cortex",
      "publisher": "Cerebral Cortex",
      "releaseDate": "Mar 2013",
      "url": "https://meyerbox.travismeyer.us/url/grtdrfs4itzjqwb3",
      "summary": "The dorsolateral prefrontal and posterior parietal cortex are 2 com-ponents of the cortical network controlling attention, workingmemory, and executive function. Little is known about how the ana-tomical organization of the 2 areas accounts for their functionalspecialization"
    },
    {
      "name": "Neural Correlates of a Decision Variable Before Learning to Perform a Match/Non-Match Task",
      "publisher": "Journal of Neuroscience",
      "releaseDate": "May 2012",
      "url": "https://meyerbox.travismeyer.us/url/miaguvuvayifspw4",
      "summary": "The lateral prefrontal cortex plays an important role in working memory and decision-making, although little is known about how neuralcorrelates of these functions are shaped by learning. To understand the effect of learning on the neuronal representation of decision-making,werecordedsingleneuronsfromthelateralprefrontalcortexofmonkeysbeforeandaftertheyweretrainedtojudgewhethertwostimuli appeared at matching spatial locations."
    },
    {
      "name": "Statistical learning of visual transitions in monkey inferotemporal cortex",
      "publisher": "Proceedings of the National Academy of Sciences",
      "releaseDate": "Nov 2011",
      "url": "https://meyerbox.travismeyer.us/url/bwbsacb7ixhfmcre",
      "summary": "One of the most fundamental functions of the brain is to predictupcoming events on the basis of the recent past. A closely relatedfunction is to signal when a prediction has been violated."
    },
    {
      "name": "Stimulus Selectivity in Dorsal and Ventral Prefrontal Cortex after Training in Working Memory Tasks",
      "publisher": "Journal of Neuroscience",
      "releaseDate": "Apr 2011",
      "url": "https://meyerbox.travismeyer.us/url/juiaxifevpez2nui",
      "summary": "The prefrontal cortex is known to represent different types of information in working memory. Contrasting theories propose that thedorsal and ventral regions of the lateral prefrontal cortex are innately specialized for the representation of spatial and nonspatialinformation, respectively (Goldman-Rakic, 1996), or that the two regions are shaped by the demands of cognitive tasks imposed on them(Miller, 2000)"
    },
    {
      "name": "Changes in Prefrontal Neuronal Activity after Learning to Perform a Spatial Working Memory Task",
      "publisher": "Cerebral Cortex",
      "releaseDate": "Apr 2011",
      "url": "https://meyerbox.travismeyer.us/url/iswtnmyk4bgvuzme",
      "summary": "The prefrontal cortex is considered essential for learning to performcognitive tasks though little is known about how the representationof stimulus properties is altered by learning. To address this issue,we recorded neuronal activity in monkeys before and after trainingon a task that required visual working memory."
    },
    {
      "name": "Comparison of neural activity related to working memory in primate dorsolateral prefrontal and posterior parietal cortex",
      "publisher": "Frontiers in Systems Neuroscience",
      "releaseDate": "Apr 2010",
      "url": "https://meyerbox.travismeyer.us/url/ayuvxhnhpphmc4qt",
      "summary": "Neurons in a distributed network of cortical and subcortical areas continue to discharge after the presentation and disappearance of stimuli, providing a neural correlate for working memory. While it is thought that the prefrontal cortex plays a central role in this network, the relative contributions of other brain areas are not as well understood."
    },
    {
      "name": "Persistent Discharges in the Prefrontal Cortex of Monkeys Naive to Working Memory Tasks",
      "publisher": "Cerebral Cortex",
      "releaseDate": "Aug 2007",
      "url": "https://meyerbox.travismeyer.us/url/eksiwdude6fyrgci",
      "summary": "Neurons in the prefrontal cortex and a network of interconnectedbrain areas discharge in a persistent fashion after the offset ofsensory stimulation. Such persistent discharges are thought toconstitute a neuronal correlate of working memory."
    },
    {
      "name": "A software solution for the control of visual behavioral experimentation",
      "publisher": "Journal of Neuroscience Methods",
      "releaseDate": "Mar 2005",
      "url": "https://meyerbox.travismeyer.us/url/rzmpjkyimc5pecuu",
      "summary": "Psychophysical and neurophysiological research requires precise control of experimental devices for the purpose of delivering stimuli andmonitoring behavioral and neural responses. This has previously been accomplished by complex, often proprietary, programmable systems,interfacing with a limited range of hardware."
    }
  ]
}
